Revit 2027 API
GenericZone.Perimeter Property
 The perimeter for the zone, in feet.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Perimeter { get; }
Public ReadOnly Property Perimeter As Double
	Get
public:
property double Perimeter {
	double get ();
}
member Perimeter : float with get
Property Value
Double
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace